/**************************************************************************//*!
 *  @file           if_button.c
 *  @brief          [APP] オプション・アプリ
 *  @author         Ryoji Morita
 *  @attention      none.
 *  @sa             none.
 *  @bug            none.
 *  @warning        none.
 *  @version        1.00
 *  @last updated   2020.02.24
 *************************************************************************** */
#ifdef __cplusplus
    extern "C"{
#endif


//********************************************************
/* include                                               */
//********************************************************
#include "if_button.h"

//#define DBG_PRINT
#define MY_NAME "APP"
#include "../log/log.h"


//********************************************************
/*! @def                                                 */
//********************************************************
// なし


//********************************************************
/*! @struct                                              */
//********************************************************
// なし


//********************************************************
/* Global Parameter  ( Global Scope )                    */
//********************************************************
// なし


//********************************************************
/* Global Parameter  ( File Scope )                      */
//********************************************************
// なし


//********************************************************
/* 関数プロトタイプ宣言                                  */
//********************************************************
// なし




/**************************************************************************//*!
 * @brief     マイナス SW が押されたか？どうかを返す。
 * @attention なし。
 * @note      なし。
 * @sa        なし。
 * @author    Ryoji Morita
 * @return    なし。
 *************************************************************************** */
EHalBool_t
AppIfBtn_IsMinus(
    void
){
    return HalPushSw_Get( EN_PUSH_SW_0 );
}


/**************************************************************************//*!
 * @brief     プラス SW が押されたか？どうかを返す。
 * @attention なし。
 * @note      なし。
 * @sa        なし。
 * @author    Ryoji Morita
 * @return    なし。
 *************************************************************************** */
EHalBool_t
AppIfBtn_IsPlus(
    void
){
    return HalPushSw_Get( EN_PUSH_SW_1 );
}


/**************************************************************************//*!
 * @brief     エンター SW が押されたか？どうかを返す。
 * @attention なし。
 * @note      なし。
 * @sa        なし。
 * @author    Ryoji Morita
 * @return    なし。
 *************************************************************************** */
EHalBool_t
AppIfBtn_IsEnter(
    void
){
    return HalPushSw_Get( EN_PUSH_SW_2 );
}


/**************************************************************************//*!
 * @brief     プラス SW とマイナス SW が押されたか？どうかを返す。
 * @attention なし。
 * @note      なし。
 * @sa        なし。
 * @author    Ryoji Morita
 * @return    なし。
 *************************************************************************** */
EHalBool_t
AppIfBtn_IsPlusMinus(
    void
){
    EHalBool_t  ret = EN_FALSE;

    if( AppIfBtn_IsMinus() && AppIfBtn_IsPlus() )
    {
        ret = EN_TRUE;
    }
    return ret;
}


/**************************************************************************//*!
 * @brief     すべての SW が押されたか？どうかを返す。
 * @attention なし。
 * @note      なし。
 * @sa        なし。
 * @author    Ryoji Morita
 * @return    なし。
 *************************************************************************** */
EHalBool_t
AppIfBtn_IsAll(
    void
){
    EHalBool_t  ret = EN_FALSE;

    if( AppIfBtn_IsMinus() && AppIfBtn_IsPlus() && AppIfBtn_IsEnter() )
    {
        ret = EN_TRUE;
    }
    return ret;
}


#ifdef __cplusplus
    }
#endif

