/**************************************************************************//*!
 *  @file           menu.h
 *  @brief          [APP] 外部公開 API を宣言したヘッダファイル。
 *  @author         Ryoji Morita
 *  @attention      none.
 *                  関数命名規則
 *                      通常関数 : App[モジュール名]_処理名()
 *  @sa             none.
 *  @bug            none.
 *  @warning        none.
 *  @version        1.00
 *  @last updated   2016.07.04
 *************************************************************************** */

// 多重コンパイル抑止
#ifndef _APP_MENU_H_
#define _APP_MENU_H_


//********************************************************
/* include                                               */
//********************************************************
// なし


//********************************************************
/*! @def                                                 */
//********************************************************
// なし


//********************************************************
/*! @enum                                                */
//********************************************************
typedef enum tagEAppMenuMsg
{
    EN_MENU_MSG_ERR_WARNING = 4,   // 動作した結果、異常だが、継続して動作可能である場合、このエラーを送信する
    EN_MENU_MSG_ERR_FATAL   = 3,   // 動作した結果、異常で継続することも修正することも不可能な場合、このエラーを送信する
    EN_MENU_MSG_ERR_COMMAND = 2,   // コマンドからの返答が期待した内容ではない場合、"呼び出し元"はこのエラーを送信する
    EN_MENU_MSG_DONE        = 1,   // 正常にコマンドを実行（= 終了）した場合、このメッセージを送信する
    EN_MENU_MSG_ACK         = 0    // コマンドがDone、エラー以外のメッセージを送信したい場合、このメッセージを送信する
} EAppMenuMsg_t;


//********************************************************
/*! @struct                                              */
//********************************************************
// なし


//********************************************************
/* 関数プロトタイプ宣言                                  */
//********************************************************
void    AppMenu_Main( unsigned char* str );


#endif  /* _APP_MENU_H_ */

